notes/Sep-15.org
* Taylor Series Approx.
Suppose f has $\infty$ many derivatives near a point a. Then the taylor series is given by

$f(x) = \Sigma_{n=0}^{\infty} \frac{f^{(n)}(a)}{n!}(x-a)^n$

For increment notation we can write

$f(a + h) = f(a) + f'(a)(a+h - a) + \dots$

$= \Sigma_{n=0}^{\infty} \frac{f^{(n)}(a)}{h!} (h^n)$

Consider the approximation

$e = |f'(a) - \frac{f(a + h) - f(a)}{h}| = |f'(a) - \frac{1}{h}(f(a + h) - f(a))|$

Substituting...

$= |f'(a) - \frac{1}{h}((f(a) + f'(a) h + \frac{f''(a)}{2} h^2 + \cdots) - f(a))|$

$f(a) - f(a) = 0$... and $distribute the h$

$= |-1/2 f''(a) h + \frac{1}{6}f'''(a)h^2 \cdots|$

** With Remainder
We can determine for some u $f(a + h) = f(a) + f'(a)h + \frac{1}{2}f''(u)h^2$

and so the error is $e = |f'(a) - \frac{f(a + h) - f(a)}{h}| = |\frac{h}{2}f''(u)|$

- [https://openstax.org/books/calculus-volume-2/pages/6-3-taylor-and-maclaurin-series]
 + > Taylor's Theorem w/ Remainder


** Of Deriviatives

Again, $f'(a) \approx \frac{f(a+h) - f(a)}{h}$,

$e = |\frac{1}{2} f''(a) + \frac{1}{3!}h^2 f'''(a) + \cdots$

$R_2 = \frac{h}{2} f''(u)$

$|\frac{h}{2} f''(u)| \leq M h^1$

$M = \frac{1}{2}|f'(u)|$

*** Another approximation

$\text{err} = |f'(a) - \frac{f(a) - f(a - h)}{h}|$

$= f'(a) - \frac{1}{h}(f(a) - (f(a) + f'(a)(a - (a - h)) + \frac{1}{2}f''(a)(a-(a-h))^2 + \cdots))$

$= |f'(a) - \frac{1}{h}(f'(a) + \frac{1}{2}f''(a)h)|$

